void main() {
  String choice = "Направо"; 

  print("Вы стоите на развилке в темном лесу. Куда пойдете? (Налево / Направо / Прямо)");
  print("Ваш выбор: $choice");
  print("---------------------------------------------");

  switch (choice) {
    case "Налево":
      print("Вы нашли заброшенную хижину, полную золота. Вы победили!");
      break;
    case "Направо":
      print("Вы встретили разбойников. Пришлось отдать им все припасы. Игра окончена.");
      break;
    case "Прямо":
      print("Вы долго шли по тропинке и благополучно вышли к городу. Вы спаслись!");
      break;
    default:
      print("Вы испугались и остались стоять на месте. Неверный выбор!");
  }
}